In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\envs\myenv\lib\site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (2.0.12)
Requirement already satisfied: ipython in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (8.13.2)
Requirement already satisfied: ipython-genutils in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: backcall in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: traitlets>=5 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pygments>=2.4.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in c:\programdata\anaconda3\envs\myenv\lib\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)

In [2]:
%load_ext sql
%sql sqlite:///factbook.db

In [3]:
%%sql
SELECT *
FROM facts
LIMIT 10;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46),
 (6, 'ac', 'Antigua and Barbuda', 442, 442, 0, 92436, 1.24, 15.85, 5.69, 2.21),
 (7, 'ar', 'Argentina', 2780400, 2736690, 43710, 43431886, 0.93, 16.64, 7.33, 0.0),
 (8, 'am', 'Armenia', 29743, 28203, 1540, 3056382, 0.15, 13.61, 9.34, 5.8),
 (9, 'as', 'Australia', 7741220, 7682300, 58920, 22751014, 1.07, 12.15, 7.14, 5.65),
 (10, 'au', 'Austria', 83871, 82445, 1426, 8665550, 0.55, 9.41, 9.42, 5.56)]

## Q1

### Most populated country

In [4]:
%%sql
SELECT name,population
    FROM facts
    ORDER BY population DESC
    LIMIT 2;

 * sqlite:///factbook.db
Done.

[('World', 7256490011), ('China', 1367485388)]

##### World is an outlier so we should not consider it

In [5]:
%%sql
SELECT name,MAX(population)
    FROM facts
    WHERE name != "World";

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

# Q2

#### Least populated country

In [6]:
%%sql
SELECT name, MIN(population)
    FROM facts
    WHERE population !="None"
    LIMIT 1;

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

### World's total population

In [7]:
%%sql
SELECT (SUM(population)/1000000000) AS "Total population (in billions)"
    FROM facts
    WHERE name !="World";

 * sqlite:///factbook.db
Done.

[(7,)]

### Top 5 countries with highest population growth

In [8]:
%%sql
SELECT name,population_growth
    FROM facts
    ORDER BY population_growth DESC
    LIMIT 5;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]

### Top 5 countries with population growth higher than average growth

In [9]:
%%sql
SELECT AVG(population_growth)
    FROM facts;

 * sqlite:///factbook.db
Done.

[(1.2009745762711865,)]

In [11]:
%%sql
SELECT name,population_growth
    FROM facts
    WHERE population_growth >
        (SELECT AVG(population_growth)
        FROM facts)
    ORDER BY population_growth DESC
    LIMIT 5;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]

#### Countries with highest population density

#### Population Density = Population / Land Area

In [13]:
%%sql
 SELECT name ,ROUND(CAST(population AS FLOAT)/area_land,2) AS "Population_density"
    FROM facts
    ORDER BY Population_density DESC
    LIMIT 5;

 * sqlite:///factbook.db
Done.

[('Macau', 21168.96),
 ('Monaco', 15267.5),
 ('Singapore', 8259.78),
 ('Hong Kong', 6655.27),
 ('Gaza Strip', 5191.82)]